{
  "en": {
    "name": "Oleg Korolev",
    "about-citation-1": "— For me, `BACKEND` is a way to bring the most benefit to people",
    "about-citation-2": "— `FRONTEND` is a way to express my creative side",
    "about-2015": "• 2015: Game automation.\n      My journey as a developer began in my school years. I was fascinated by automating gameplay and gaining\n      advantages over other players using my own code in AutoIt.",
    "about-2016": "• 2016: First part-time job.\n      My computer science teacher noticed how students gathered around my computer to\n      watch as I made the cookie in Cookie Clicker automatically accumulate clicks in the background. Soon\n      after, the teacher approached me with a request to restore the website of the city’s MFC, access to the hosting of\n      which had been lost by the administration. Intrigued by the task, I readily agreed.",
    "about-2017": "• 2017: First orders.\n      Having mastered the basics of web development, such as HTML, CSS, and JavaScript, I started taking my first orders. These were\n      simple projects for small companies and self-employed professionals, mainly landing pages and business cards.",
    "about-2019": "• 2019: First official job.\n      In the final years of university, I got a job at a company where I was also preparing my thesis project. My task\n      was to automate the workplace of the tender department manager.",
    "about-2020": "• 2020: Upwork.\n      I started getting orders on the international freelance platform Upwork. One of the first projects was for PillarStone\n      Technologies: I needed to restore the functionality of a Django admin panel after Google’s geocoding libraries\n      were no longer supported.",
    "about-2021": "• 2021: First major project.\n      The product company Prodlogistica UG entrusted me with a project to automate the business process of order acceptance.\n      Before automation, managers had to record orders \"on the fly\" during customer calls and then relay them to 1C operators by phone. Under my leadership, a small team developed a mobile\n      application that allowed managers to search for products, create orders, and send them directly to the 1C database.",
    "about-2022-2024": "• 2022-2024: Middle Backend Developer at Akticom.\n      I joined Akticom as a Middle Backend Developer, where over two years we developed and\n      maintained the multifunctional platform TitanControl. This platform enables remote management of\n      employees, task assignment, location tracking, and report generation."
  },
  "ru": {
    "name": "Олег Королев",
    "about-citation-1": "— Для меня `BACKEND` - это способ приносить наибольшую пользу людям",
    "about-citation-2": "— `FRONTEND` - это способ проявить свое творческое начало",
    "about-2015": "• 2015 год: Автоматизация игр.\n      Мой путь разработчика начался еще в школьные годы. Я был увлечен автоматизацией игрового процесса и получением\n      преимуществ над другими игроками с помощью собственного кода на AutoIt",
    "about-2016": "• 2016 год: Первая подработка.\n      Мой преподаватель информатики обратил внимание на то, как ребята собрались вокруг моего компьютера, чтобы\n      увидеть, как я заставил печеньку из Cookie Clicker автоматически накапливать опыт в фоновом режиме. Вскоре\n      после этого преподаватель обратился ко мне с просьбой восстановить сайт городского МФЦ, доступы к хостингу\n      которого были утеряны администрацией. Заинтересовавшись задачей, я без колебаний согласился.",
    "about-2017": "• 2017 год: Первые заказы.\n      Освоив основы веб-разработки, такие как HTML, CSS и JavaScript, я начал брать свои первые заказы. Это были\n      простые проекты для небольших компаний и частных лиц, в основном лендинги и визитные карточки.",
    "about-2019": "• 2019 год: Первая официальная работа.\n      На последних курсах университета я устроился в компанию, где готовил дипломный проект. Моя задача\n      заключалась в автоматизации рабочего места менеджера тендерного отдела.",
    "about-2020": " 2020 год: Upwork.\n      Я начал получать заказы на международной фриланс-бирже. Один из первых проектов для компании PillarStone\n      Technologies: нужно было восстановить работоспособность админки на Django. В проекте устарело все настолько что часть функционала отвалилась. Я успешно обновил Debian, интегрировал Python 3 через execnet где реализовал работу с новыми библиотеками для геокодирования и восстановил работу прочих зависимостей, что перешли на новую версию http, более не поддерживаемую в python 2",
    "about-2021": "• 2021 год: Первый крупный проект.\n      Продуктовая компания Prodlogistica UG доверила мне задачу по автоматизации бизнес-процесса приема заявок на\n      поставку продуктов. До автоматизации менеджерам приходилось записывать заказы \"на коленке\" при звонках от клиентов и затем\n      передавать их операторам 1С по телефону. Под моим руководством небольшая команда разработала мобильное\n      приложение, которое позволило менеджерам искать продукты, создавать заказы и отправлять их напрямую в базу\n      1С. ",
    "about-2022-2024": "• 2022-2024 год: Middle Backend Developer в Akticom.\n      Я устроился на позицию Middle Backend Developer в компанию Akticom, где в течение двух лет мы разрабатывали и\n      поддерживали многофункциональную платформу TitanControl. Платформа реализует функционал удаленного взаимодействия с персоналом, возможность ставить задачи, отслеживать их геопозицию, генерировать отчетность и тд."
  }
}
